Catalogs/ИА_ЗадачиПлана.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_ЗадачиПлана</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ИА_ПланыДействий</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Группировка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Состояния</v8:Type>
						<v8:Type>cfg:EnumRef.ИА_ТипыЗадачБП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_СтратегическоеУправление</v8:Type>
						<v8:Type>cfg:TaskRef.ИА_ЗадачаПланаДействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>идСобытияГугл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/КСУ_ВыгрузкаЗадачВГуглКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КСУ_ВыгрузкаЗадачВГуглКалендарь</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяВыгрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЗадачиПлана</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КСУ_ЗадачиВПлане.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КСУ_ЗадачиВПлане</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ИА_ЗадачаПланаДействий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗадачаПлана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЗадачиПлана</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ИА_ЗадачиПлана/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Время = Час(ВремяПлан)+Минута(ВремяПлан)/60;
КонецПроцедуры

Процедура СформироватьНаименование() Экспорт
	Содержание = СокрЛП(Содержание);
	Наименование = лев(Содержание,100); 
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если идСобытияГугл = "" и не Владелец.Родитель.Пустая() и ЗначениеЗаполнено(ВремяНачала) и ЗначениеЗаполнено(ВремяКонца) Тогда // дневной
		мен = РегистрыСведений.КСУ_ВыгрузкаЗадачВГуглКалендарь.СоздатьМенеджерЗаписи();
		мен.Задача = Ссылка;
		мен.Прочитать();
		мен.Задача = Ссылка;
		мен.Содержание = Содержание;
		мен.ВремяНачала = ВремяНачала;
		мен.ВремяКонца = ВремяКонца;
		мен.Дата = Владелец.ДатаНачала;
		мен.Пользователь = Владелец.Ответственный;
		мен.ТребуетсяВыгрузка = истина;
		мен.Записать();
	КонецЕсли;
	
	Если идСобытияГугл = "" и Владелец.Родитель.Пустая() И Порядок = 0 Тогда // Недельный
		Запрос = новый запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЕСТЬNULL(МАКСИМУМ(ИА_ЗадачиПлана.Порядок), 0) КАК Порядок
		               |ИЗ
		               |	Справочник.ИА_ЗадачиПлана КАК ИА_ЗадачиПлана
		               |ГДЕ
		               |	ИА_ЗадачиПлана.Владелец = &Владелец";
		Запрос.УстановитьПараметр("Владелец", Владелец);
		Выборка = запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		Порядок = Выборка.Порядок + 1;
	КонецЕсли;

	///// задачи в плане
	мен = РегистрыСведений.КСУ_ЗадачиВПлане.СоздатьМенеджерЗаписи();
	мен.ЗадачаПлана = Ссылка;
	мен.Прочитать();
	мен.ЗадачаПлана = Ссылка;
	
	Если ЗначениеЗаполнено(ЗадачаОснование) и ТипЗнч(ЗадачаОснование) = тип("ЗадачаСсылка.ИА_ЗадачаПланаДействий") и не ПометкаУдаления Тогда
		мен.Задача = ЗадачаОснование;
		мен.Пользователь = Владелец.Ответственный;
		мен.Записать();
	ИначеЕсли мен.Выбран() Тогда
		мен.Удалить();
	КонецЕсли;
КонецПроцедуры
